Revit 2024 API
ParameterTypeId.StructuralSectionCommonShearAreaStrongAxis Property
 "Shear Area strong axis"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId StructuralSectionCommonShearAreaStrongAxis { get; }
Visual Basic
Public Shared ReadOnly Property StructuralSectionCommonShearAreaStrongAxis As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ StructuralSectionCommonShearAreaStrongAxis {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace